//====================================================================
//文件名称：main.c（应用工程主函数）
//框架提供：SD-Arm（sumcu.suda.edu.cn）
//版本更新：20170801-20200502
//功能描述：见本工程的<01_Doc>文件夹下Readme.txt文件
//====================================================================

#define GLOBLE_VAR
#include "includes.h"      //包含总头文件

//----------------------------------------------------------------------
//声明使用到的内部函数
//main.c使用的内部函数声明处

//----------------------------------------------------------------------
//主函数，一般情况下可以认为程序从此开始运行（实际上有启动过程见书稿）
int main(void)
{
    //（1）======启动部分（开头）==========================================
    //（1.1）声明main函数使用的局部变量
    uint32_t mMainLoopCount;  //主循环使用的记录主循环次数变量
    uint8_t  mFlag;           //主循环使用的临时变量
    uint8_t  mLightFlag;    // 控制灯变亮或者变暗的标志
    uint16_t mReference;    // 电压的数字量

    //（1.2）【不变】关总中断
    DISABLE_INTERRUPTS;


    //（1.3）给主函数使用的局部变量赋初值
    mMainLoopCount = 0;     //主循环使用的记录主循环次数变量
    mFlag = 'A';              //主循环使用的临时变量：蓝灯状态标志
    mReference = 2500;
    mLightFlag = 1;

    //（1.4）给全局变量赋初值

    //（1.5）用户外设模块初始化
    uart_init(UART_User, 115200);
    dac_init(DAC_VDDA);

    //（1.6）使能模块中断
    uart_enable_re_int(UART_User);

    //（1.7）【不变】开总中断
    ENABLE_INTERRUPTS;

    printf("------------------------------------------------------\n");
    printf("金葫芦提示：DAC呼吸灯实例  \n");
    printf("请将一个LED灯的正极接在 PTE30号引脚，对应于GEC的4号引脚\n");
    printf("另一个引脚接地，就可以看到呼吸灯效果。\n");
    printf("------------------------------------------------------\n");

    //for(;;) {  }     //在此打桩，理解蓝色发光二极管为何亮起来了？

    //（1）======启动部分（结尾）==========================================

    //（2）======主循环部分（开头）=========================================
    for (;;)     //for(;;)（开头）
    {
        //（2.1）主循环次数+1，并判断是否小于特定常数
        mMainLoopCount++;                         //+1
        if (mMainLoopCount <= 120000)  continue;   //如果小于特定常数，继续循环
        //（2.2）主循环次数超过特定常数，清主循环次数
        mMainLoopCount = 0;

        // DAC数字量转换，即将mReference的数字值转换成对应的模拟电压值
        dac_convert(mReference);

        // 如果mLightFlag的值为0，就将mReference的值减10，相当于减小电压
        // 如果mLightFlag的值为1，就将mReference的值加10，相当于增加电压
        mReference = !mLightFlag ? mReference - 10 : mReference + 10;

        // 如果 mReference 的值超过或低于一定值, 就将mLightFlag的值翻转
        // mReference 的取值范围为 [0, 4095]
        if (mReference >= 3600) mLightFlag = 0;
        if (mReference <= 2500) mLightFlag = 1;


    }     //for(;;)结尾
    //（2）======主循环部分（结尾）========================================
}

//======以下为主函数调用的子函数存放处=====================================

//====================================================================
/*
知识要素：
（1）main.c是一个模板，该文件所有代码均不涉及具体的硬件和环境，通过调用构件
实现对硬件的干预。
（2）本文件中标有【不变】的地方为系统保留，此类代码与具体项目无关，不宜删除。
（3）本文件中对宏GLOBLE_VAR进行了定义，所以在包含"includes.h"头文件时，会定
义全局变量，在其他文件中包含"includes.h"头文件时，
编译时会自动增加extern
*/



