//=====================================================================
//文件名称：incapture.h
//功能概要：incapture底层驱动构件头文件
//制作单位：苏州大学嵌入式系统与物联网研究所(sumcu.suda.edu.cn)
//版    本：  2019-05-09  V2.0
//适用芯片：KL25、KL26、KL36
//=====================================================================

#ifndef _INCAPTURE_H_
#define _INCAPTURE_H_

#include "mcu.h"     //包含公共要素头文件


//输入捕捉边沿获取模式宏定义
#define CAP_UP      0
#define CAP_DOWN    1
#define CAP_DOUBLE  2


//===================================================================
//函数名称：incap_init
//功能概要：incap模块初始化。
//参数说明：capNo：模块号，使用gec.h中宏定义，例如INCAP_PIN0
//        clockFre：时钟频率，单位：Khz，取值：375、750、1500、3000、6000、
//                                                   12000、24000、48000
//        period：周期，单位ms，如10，100...
//        capmode：输入捕捉模式（上升沿、下降沿、双边沿），有宏定义常数使用
//函数返回：无
//注意：          因为GEC中给出的PWM和输入捕捉都是同一模块的，只是通道不同，所以为防止在使用多组
//          PWM和输入捕捉时，频率篡改，需要使得使用到的clockFre和period参数保持一致。
//===================================================================
void incapture_init(uint16_t capNo,uint32_t clockFre,uint16_t period,uint8_t capmode);


//=====================================================================
//函数名称：incapture_value
//功能概要：获取该通道的计数器当前值
//参数说明：capNo：模块号，使用gec.h中宏定义，例如INCAP_PIN0
//函数返回：通道的计数器当前值
//=====================================================================
uint16_t get_incapture_value(uint16_t capNo);

//===================================================================
//函数名称：cap_enable_int
//功能概要：使能输入捕捉中断。
//参数说明：capNo：模块号，使用gec.h中宏定义，例如INCAP_PIN0
//函数返回：无
//===================================================================
void cap_enable_int(uint16_t capNo);

//===================================================================
//函数名称：cap_disable_int
//功能概要：禁止输入捕捉中断。
//参数说明：capNo：模块号，使用gec.h中宏定义，例如INCAP_PIN0
//函数返回：无
//===================================================================
void cap_disable_int(uint16_t capNo);

//===================================================================
//函数名称：cap_clear_flag
//功能概要：清输入捕捉中断标志位。
//参数说明：capNo：模块号，使用gec.h中宏定义，例如INCAP_PIN0
//函数返回：无
//===================================================================
void cap_clear_flag(uint16_t capNo);

//===================================================================
//函数名称：cap_get_flag
//功能概要：获取输入捕捉中断标志位。
//参数说明：capNo：模块号，使用gec.h中宏定义，例如INCAP_PIN0
//函数返回：返回当前中断标志位
//===================================================================
uint8_t cap_get_flag(uint16_t capNo);


#endif /* 03_MCU_MCU_DRIVERS_INCAPTURE_INCAPTURE_H_ */
