//====================================================================
//文件名称：main.c（应用工程主函数）
//框架提供：SD-Arm（sumcu.suda.edu.cn）
//版本更新：20170801-20200502
//功能描述：见本工程的<01_Doc>文件夹下Readme.txt文件
//====================================================================

#define GLOBLE_VAR
#include "includes.h" //包含总头文件

//----------------------------------------------------------------------
//声明使用到的内部函数
//main.c使用的内部函数声明处

//----------------------------------------------------------------------
//主函数，一般情况下可以认为程序从此开始运行（实际上有启动过程见书稿）
int main(void)
{
    //（1）======启动部分（开头）==========================================
    //（1.1）声明main函数使用的局部变量
    uint32_t mMainLoopCount; //主循环使用的记录主循环次数变量

    //（1.2）【不变】关总中断
    DISABLE_INTERRUPTS;
    wdog_stop();

    //（1.3）给主函数使用的局部变量赋初值

    //（1.4）给全局变量赋初值

    //（1.5）用户外设模块初始化
    //GPIO基本编程步骤(蓝灯接在MCU的PTA13，参见user.h)：

    //（1.5.1）计算给出PORTA13的引脚控制寄存器地址
    //PORTA端口的引脚控制寄存器基地址为0x40049000u（后缀u表示无符号数）
    volatile uint32_t *portA_ptr = (uint32_t *)0x40049000u;
    //PORTA13的引脚控制寄存器地址=基地址+偏移量
    volatile uint32_t *portA_PCR_5 = portA_ptr + 5;

    //（1.5.2）计算给出PORTA的数据方向寄存器、输出反转寄存器地址
    //PORTA端口（作为GPIO功能）的基地址为0x400FF000u
    volatile uint32_t *gpioA_ptr = (uint32_t *)0x400FF000u;
    //PORTB的数据方向寄存器地址=基地址+偏移量
    volatile uint32_t *portA_PDDR = gpioA_ptr + 5;
    //PORTA的输出寄存器地址=基地址+偏移量
    volatile uint32_t *portA_PDO = gpioA_ptr + 0;
    //PORTB的输出反转寄存器地址=基地址+偏移量
    volatile uint32_t *portA_PTOR = gpioA_ptr + 3;

    //（1.5.3）设置PORTA13引脚为GPIO引脚，即令相应引脚控制寄存器的10-8位
    //(MUX)字段为001
    *portA_PCR_5 &= 0b11111111111111111111100011111111; //清MUX位段
    *portA_PCR_5 |= 0b00000000000000000000000100000000;

    //（1.5.4）通过PORTA的输出寄存器(给蓝色小灯的寄存器）赋初值1，保证定义为输出时为暗
    *portA_PDO |= (1 << 5);

    //（1.5.5）通过PORTA的方向寄存器，定义PORTA13引脚输出
    *portA_PDDR |= (1 << 5);

    //（1.5.6）点亮红色发光二极管
    *portA_PDO &= ~(1 << 5); //亮

    //（1.6）使能模块中断

    //（1.7）【不变】开总中断
    ENABLE_INTERRUPTS;

    //（1）======启动部分（结尾）==========================================

    //（2）======主循环部分（开头）========================================
    for (;;) //for(;;)（开头）
    {
        //（2.1）主循环次数+1，并判断是否小于特定常数
        mMainLoopCount++; //+1
        if (mMainLoopCount <= 13000000)
            continue; //如果小于特定常数，继续循环
        //（2.2）主循环次数超过特定常数，灯状态进行切换（这样灯会闪烁）
        mMainLoopCount = 0; //清主循环次数

        // 使用输出取反寄存器改变等的亮暗
        *portA_PTOR |= (1 << 5);

    } //for(;;)结尾
    //（2）======主循环部分（结尾）=====================================
}

//======以下为主函数调用的子函数存放处===================================

//======================================================================
/*
知识要素：
（1）main.c是一个模板，该文件所有代码均不涉及具体的硬件和环境，通过调用构件
实现对硬件的干预。
（2）本文件中标有【不变】的地方为系统保留，此类代码与具体项目无关，不宜删除。
（3）本文件中对宏GLOBLE_VAR进行了定义，所以在包含"includes.h"头文件时，会定
义全局变量，在其他文件中包含"includes.h"头文件时，
编译时会自动增加extern
*/