//=====================================================================
//文件名称：isr.c（中断处理程序源文件）
//框架提供：SD-ARM（sumcu.suda.edu.cn）
//版本更新：20170801-20191020
//功能描述：提供中断处理程序编程框架
//=====================================================================
#include "includes.h"

void UART_User_Handler(void) {
  DISABLE_INTERRUPTS;  //关总中断
  //------------------------------------------------------------------
  uint8_t flag;
  // 要接收的数据最后两个字符一定要以'\', '0'结尾
  //	uart_reN()在接收完毕后会自动去掉这两个字符
  gSelect = uart_re1(UART_User, &flag) - '0';

  //------------------------------------------------------------------
  ENABLE_INTERRUPTS;  //开总中断
}

//=====================================================================
//函数名称：TIMER_USER_Handler（TIMERB定时器中断处理程序）
//参数说明：无
//函数返回：无
//功能概要：（1）每20ms中断触发本程序一次；（2）达到一秒时，调用秒+1
//           程序，计算“时、分、秒”
//特别提示：（1）使用全局变量字节型数组gTime[3]，分别存储“时、分、秒”
//        （2）注意其中静态变量的使用
//=====================================================================
void TIMER_User_Handler(void) {
  DISABLE_INTERRUPTS;  //关总中断
  //------------------------------------------------------------------
  gBeat--;

  timer_clear_int(TIMER_USER);  //清时钟溢出标志位
  //------------------------------------------------------------------
  ENABLE_INTERRUPTS;  //开总中断
}