//======================================================================
//文件名称：TM1637.h
//功能概要：数码管传感器构件头文件
//制作单位：苏大arm技术中心(sumcu.suda.edu.cn)
//更新记录：20190401 CHY
//======================================================================


#ifndef _TM1637_H     //防止重复定义（_ADLX345_H  开头)
#define _TM1637_H


#include "gec.h"      //包含gpio头文件


//====================接口函数声明=======================================

//======================================================================
//函数名称：TM1637_Init
//函数参数：tm1637用到的两个引脚clk_pin、dio_pin
//函数返回：无
//功能概要：向TM1637初始化
//======================================================================
void TM1637_Init(uint16_t clk_pin,uint16_t dio_pin);

//======================================================================
//函数名称：tm1637_Display
//函数参数：a,b,c,d分别表示在第1,2,3,4位数码管上显示的数字
//函数返回：无
//功能概要：向TM1637写入传输的一个字节的数据
//======================================================================
void TM1637_Display(uint8_t a,uint8_t a1,uint8_t b,uint8_t b1,uint8_t c,
		uint8_t c1,uint8_t d,uint8_t d1);
		
void tm1637_Dly_ms(uint32_t ms);

#endif    //防止重复定义（_ADLX345_H  结尾)
