//======================================================================
//文件名称：ws2812.h
//功能概要：ws2812彩灯构件头文件
//制作单位：苏大arm技术中心(sumcu.suda.edu.cn)
//更新记录：20190309
//======================================================================


#ifndef _WS2812_H     //防止重复定义（_ADLX345_H  开头)
#define _WS2812_H

#include "gpio.h"            //包含gpio头文件


//====================接口函数声明=======================================

//======================================================================
//函数名称：ws_Init
//函数参数：port_pin：控制ws2812的GPIO
//函数返回：无
//功能概要：设置ws2812灯珠的颜色
//======================================================================
void WS_Init(uint16_t port_pin);

//======================================================================
//函数名称：ws_sendOnePix
//函数参数：port_pin：控制ws2812的GPIO;ptr：代表灯珠颜色的字节数组;num:灯珠数量
//函数返回：无
//功能概要：设置ws2812灯珠的颜色
//======================================================================
void WS_SendOnePix(uint16_t port_pin,uint8_t *ptr,uint8_t num);


#endif    //防止重复定义（_ADLX345_H  结尾)
