//=====================================================================
//文件名称：isr.c（中断处理程序源文件）
//框架提供：SD-ARM（sumcu.suda.edu.cn）
//版本更新：20170801-20191020
//功能描述：提供中断处理程序编程框架
//=====================================================================
#include "includes.h"
//======================================================================
//中断服务程序名称：UART_USER_Handler
//触发条件：UART_USE串口收到一个字节触发
//功    能：收到一个字节，直接返回该字节
//备    注：进入本程序后，可使用uart_get_re_int函数可再进行中断标志判断
//          （1-有UART接收中断，0-没有UART接收中断）
//======================================================================
void UART_User_Handler(void) {
  uint32_t ch;
  uint8_t flag;
  uint8_t arr[2];
  DISABLE_INTERRUPTS;  //关总中断
  //------------------------------------------------------------------
  // 最大值减去剩余的值就是接收的数值
  gLen = dma_get_recv_count(DMA_RECV);
  gRecvBuff[gLen] = '\0';
  printf("进入空闲线中断: %d\n", gLen);

  // 使能DMA接收传输，接收下一个到来的字符串
  dma_uart_recv(DMA_RECV, (uint32_t)gRecvBuff, DMA_DSR_BCR_MAXLEN);
  uart_clear_idle_int(UART_User);  // 清除空闲线中断
  //------------------------------------------------------------------
  ENABLE_INTERRUPTS;  //开总中断
}

/*
 知识要素：
 1.本文件中的中断处理函数调用的均是相关设备封装好的具体构件，在更换芯片
 时，只需保证设备的构件接口一致，即可保证本文件的相关中断处理函数不做任何
 更改，从而达到芯片无关性的要求。
 */
