//======================================================================
//文件名称：TM1637.c
//功能概要：数码管构件源文件
//制作单位：苏大arm技术中心(sumcu.suda.edu.cn)
//更新记录：20190401 CHY
//======================================================================

#include "TM1637.h"    //包含TM1637头文件
//文件级全局变量
uint8_t tab[22] =
{
        0x3F,    //0
        0x06,    //1
        0x5B,    //2
        0x4F,    //3
        0x66,    //4
        0x6D,    //5
        0x7D,    //6
        0x07,    //7
        0x7F,    //8
        0x6F,    //9
        0x77,    //10
        0x7C,    //11
        0x58,    //12
        0x5E,    //13
        0x79,    //14
        0x71,    //15
        0x76,    //16
        0x38,    //17
        0x54,    //18
        0x73,    //19
        0x3E,    //20
        0x00,    //21
};
uint16_t CLK_PIN;
uint16_t DIO_PIN;
//内部函数声明
void TM1637_start(void);
void TM1637_ack(void);
void TM1637_stop(void);
void TM1637_Write(uint8_t Data);

//====================接口函数声明=========================================
//======================================================================
//函数名称：TM1637_Init
//函数参数：tm1637用到的两个引脚
//函数返回：无
//功能概要：向TM1637初始化
//======================================================================
void TM1637_Init(uint16_t clk_pin,uint16_t dio_pin)
{
	CLK_PIN=clk_pin;
	DIO_PIN=dio_pin;
}
//======================================================================
//函数名称：tm1637_Display
//函数参数：a,b,c,d分别表示在第1,2,3,4位数码管上显示的数字
//       a1,b1,c1,d1分别表示是否显示数字之后的点。1表示显示，0表示不显示
//函数返回：无
//功能概要：向TM1637写入传输的一个字节的数据
//======================================================================
void TM1637_Display(uint8_t a,uint8_t a1,uint8_t b,uint8_t b1,uint8_t c,
		uint8_t c1,uint8_t d,uint8_t d1)
{
	TM1637_start();
	TM1637_Write(0x40);    //写数据到显示寄存器+自动地址加1+普通模式
	TM1637_ack();
	TM1637_stop();
	TM1637_start();
	TM1637_Write(0xc0);    //设置显示首地址即第一个LED
	TM1637_ack();

	TM1637_Write(tab[a]|a1<<7);
	TM1637_ack();
	TM1637_Write(tab[b]|b1<<7);    //h为1时显示时钟中间的两点
	TM1637_ack();
	TM1637_Write(tab[c]|c1<<7);
	TM1637_ack();
	TM1637_Write(tab[d]|d1<<7);
	TM1637_ack();

	TM1637_stop();
	TM1637_start();
	TM1637_Write(0x89);    //显示控制：开显示，2/16亮度
	TM1637_ack();
	TM1637_stop();
}
//==========================内部函数声明===================================
//======================================================================
//函数名称：TM1637_start
//函数参数：无
//函数返回：无
//功能概要：TM1637开始传输数据。CLK为高，DIO由高变低，数据输入开始
//======================================================================
void TM1637_start(void)
{
	 gpio_init(CLK_PIN,1,1);    //初始化为GPIO，输出，高电平
	 gpio_init(DIO_PIN,1,1);    //初始化为GPIO，输出，高电平
	 tm1637_Dly_ms(2);
	 gpio_set(DIO_PIN,0);       //CLK为高，DIO由高变低，数据输入开始
}

//======================================================================
//函数名称：TM1637_ack
//函数参数：无
//函数返回：无
//功能概要：TM1637应答数据
//======================================================================
void TM1637_ack(void)
{
	gpio_set(CLK_PIN,0);
	tm1637_Dly_ms(5);
	gpio_set(DIO_PIN,1);
	tm1637_Dly_ms(5);
	gpio_set(CLK_PIN,1);
	tm1637_Dly_ms(2);
	gpio_set(CLK_PIN,0);
}

//======================================================================
//函数名称：TM1637_stop
//函数参数：无
//函数返回：无
//功能概要：TM1637传输一位数据完成。CLK为高时，DIO由低变高
//======================================================================
void TM1637_stop(void)
{
    gpio_set(DIO_PIN,0);
    tm1637_Dly_ms(2);
	gpio_set(CLK_PIN,1);
	tm1637_Dly_ms(2);
	gpio_set(DIO_PIN,1);
	tm1637_Dly_ms(2);
}

//======================================================================
//函数名称：TM1637_Write
//函数参数：Data:要显示的一个字节的数据
//函数返回：无
//功能概要：向TM1637写入传输的一个字节的数据
//======================================================================
void TM1637_Write(uint8_t Data)
{
	uint8_t i;
	for(i=0;i<8;i++)
	{
		gpio_set(CLK_PIN,0);    //CLK为低时，DIO上才可以从传数据
		if(Data & 0x01)
		    gpio_set(DIO_PIN,1);
		else
			gpio_set(DIO_PIN,0);
		tm1637_Dly_ms(3);
		Data=Data>>1;
		gpio_set(CLK_PIN,1);    //一位数据传输完，CLK拉高
		tm1637_Dly_ms(3);
	}
}

void tm1637_Dly_ms(uint32_t ms)
{
    for(uint32_t i= 0; i < (6000*ms); i++) __asm("nop");
}





