//=====================================================================
//文件名称：isr.c（中断处理程序源文件）
//框架提供：SD-ARM（sumcu.suda.edu.cn）
//版本更新：20170801-20191020
//功能描述：提供中断处理程序编程框架
//=====================================================================
#include "includes.h"
//======================================================================
//中断服务程序名称：UART_USER_Handler
//触发条件：UART_USE串口收到一个字节触发
//功    能：收到一个字节，直接返回该字节
//备    注：进入本程序后，可使用uart_get_re_int函数可再进行中断标志判断
//          （1-有UART接收中断，0-没有UART接收中断）
//======================================================================
void UART_User_Handler(void)
{
	DISABLE_INTERRUPTS; //关总中断
	//------------------------------------------------------------------

	// 要接收的数据最后两个字符一定要以'\', '0'结尾
	//	uart_reN()在接收完毕后会自动去掉这两个字符
	uint32_t len = uart_reN(UART_User, gRecvBuff);

	if (len) {
		uart_send_string(UART_User, gRecvBuff);

		if (!strcmp(gRecvBuff, "open")) {
			gpio_set(LIGHT_BLUE, LIGHT_ON);
		}
		if (!strcmp(gRecvBuff, "close")) {
			gpio_set(LIGHT_BLUE, LIGHT_OFF);
		}
		printf("ddd\n");
	}

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS; //开总中断
}

/*
 知识要素：
 1.本文件中的中断处理函数调用的均是相关设备封装好的具体构件，在更换芯片
 时，只需保证设备的构件接口一致，即可保证本文件的相关中断处理函数不做任何
 更改，从而达到芯片无关性的要求。
 */
