//=====================================================================
//文件名称：timer.h
//功能概要：timer底层驱动构件头文件
//制作单位：苏州大学嵌入式系统与物联网研究所(sumcu.suda.edu.cn)
//版    本：  2019-05-09  V2.0
//适用芯片：KL25、KL26、KL36
//=====================================================================
#ifndef TIMER_H
#define TIMER_H
#include "mcu.h"     //包含公共要素头文件

//timer
#define TIMERA  0   //LPTMR
//TPM
#define TIMERB  1   //TPM1
#define TIMERC  2   //TPM2


//LPTMR时钟源
#define LPOCLK     1
#define IRC32KCLK  2
#define IRC4MCLK   3
#define OSCERCLK   4

//确认中断标志
#define CONFIRM_LPTMR_FLAG  ((LPTMR0_CSR & LPTMR_CSR_TCF_MASK) == \
                                                        LPTMR_CSR_TCF_MASK)
//清中断标志
#define CLEAR_LPTMR_FLAG    (LPTMR0_CSR |= LPTMR_CSR_TCF_MASK)

//============================================================================
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//                 time_ms 定时器中断的时间间隔，单位为毫秒，
//                 其中timer0设置范围 0~65535ms，
//                       timer1与
//                 timer2定时时长范围为0~21845ms
//功能概要：时钟模块初始化，其中timer0为低功耗时钟 timer1与timer2为非低功耗时钟
//============================================================================
void timer_init(uint8_t timer_No,uint32_t time_ms);


//============================================================================
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：时钟模块使能，开启时钟模块中断及定时器中断
//============================================================================
void timer_enable_int(uint8_t timer_No);

//============================================================================
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：定时器中断除能
//============================================================================
void timer_disable_int(uint8_t timer_No);

//===================================================================
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：获取timer模块中断标志
//函数返回：中断标志 1=有对应模块中断产生;0=无对应模块中断产生
//===================================================================
uint8_t timer_get_int(uint8_t timer_No);

//============================================================================
//函数返回：无
//参数说明： timer_No:时钟模块号  具体时钟模块号见gec.h文件定义
//功能概要：定时器清除中断标志
//============================================================================
void timer_clear_int(uint8_t timer_No);


#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
